kateya-luo/luoye/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1U-N16R8:16MB QIO Flash + 8MB 八线 PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 小块内存留内部 RAM(WiFi/DMA 需要),大缓冲(音频环形/上传)显式走 PSRAM
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000

# Bulk-upload TCP profile: keep enough data in flight on public WAN paths.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=24
CONFIG_LWIP_TCP_SACK_OUT=y

# FATFS 长文件名 + UTF-8(会话目录名含日期)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
